import React from 'react';
import styled from 'styled-components';
import { ReactComponent as HomeSvg } from '../../assets/images/home.svg';
import { ReactComponent as SearchSvg } from '../../assets/images/search.svg';
import { ReactComponent as BellSvg } from '../../assets/images/bell.svg';
import { ReactComponent as DmSvg } from '../../assets/images/dm.svg';

const Wrapper = styled.div`
color: white;
background-color: #18222c;
overflow-wrap: normal;
overflow-y: scroll;
height: 100%;
width: 100%;
`;

const Content = styled.div`
height: 100%;
width: 100%;
`;

export default () => {
  return (
    <Wrapper>
      <Content>
        基本的にはハチと共通の特徴を持つ。体はおおむね円筒形で細長く、頭部、胸部、腹部のそれぞれの間がくびれ、大きく動かすことができる。腹部の前方の節が細くくびれて柄のようになった「腹柄節」は昆虫でもアリだけにある器官であり、狭い穴の中での生活に適応すべく役割を果たしている。体色は黒いものが多いが、黄色、褐色、赤色などの種類もいる。

        頭部には大顎が発達し、餌をくわえたり外敵に噛みついたりできる。複眼はあるが、単眼は退化するものが多い。1対の触角が発達しており、その基部の節が特に長く、「柄節」と呼ばれる。そのため触角全体としてはこの節の先で折れ曲がり、くの字型をなす例が多い。

        胸部は体の中央にまとまっているが、これは実際には四つの節からなり、前中後3節の胸部に、腹部第1節が癒合したものである。歩脚3対はよく発達する。

        腹部前端には柄のように狭まった部分があり、これを腹柄部という。腹柄部は一節ないし二節からなる。後端にはハチと同じように毒腺を持ち、針で刺すことのできる種も少なくない。

        社会性昆虫であり、同種であっても、カーストによって形態が異なる。繁殖をする雌雄（雄と女王）、それに働き蟻（雌）は形態的に区別できる。働き蟻の中に、さらに複数の形態差が見られる場合もある。繁殖行動を行う雄アリと雌アリには翅がある。女王は、後に翅を切り離して無翅になる。それに対して、働き蟻は当初から翅を持たない。数の上では、これが圧倒的に多いので、一般的にはアリは無翅の昆虫との印象がある。

        針と毒腺
        日本で人家の周囲に見られるアリの多くは針を持たず、持っていても針が脆弱であまり刺さない種類が多い。しかし、特殊化の進んだヤマアリ亜科やカタアリ亜科のアリを除けば、系統的には針を持つものが多数派である。熱帯には、積極的に針で攻撃する種が多い。かなり高等な分類群でも、フタフシアリ亜科は針を持つ。

        針を持たないか、刺すほど強靭な針を持たないアリは多くの場合、毒液を敵や獲物の体表に付着、或いは飛ばして相手を攻撃する[要出典]。針を持つ種類はハチと同様に針を使って毒液を注入する。毒液の主成分は蟻酸とされていることが多い[要出典]が、これはヤマアリ亜科に限られる。これと同様に針を持たないカタアリ亜科や、針を持つフタフシアリ亜科の中でも、刺すだけではなく噴き出した毒液を直接相手にかける使い方もする。シリアゲアリ属のアリは、別の種類の刺激性物質が主成分である。針で刺して攻撃するアリの毒は、多くのハチと同様、タンパク質やペプチドその他の生理活性物質の混合物である。

        熱帯性の大型種の毒は、刺した時にスズメバチと同程度の激しい症状を引き起こす。日本でも、暖地にある人家周辺に多いハリアリ亜科のオオハリアリ、寒冷地では草木の上でよく活動しているフタフシアリ亜科のクシケアリ類がかなり強力な毒針を持つ。また人家内に生息するフタフシアリ亜科のイエヒメアリも、微細ながら積極的に針で人体を刺すため、ちくちくした不快感を持つ被害がある。

        生態
        食性
        アリの食性の基本は肉食だが、種類によって草食、菌食、雑食が分化している。生きた動物を襲う種類から自ら栽培した菌類を主食にする種類まで、多種多様な食性が知られているが、エネルギー源として植物の蜜やアブラムシの甘露、タンパク質源として肉食をする種が多い。肉食の種では、特に土壌性の小型種で、トビムシ、ムカデ、ササラダニなど、ほぼ特定の生物のみを襲って獲物にしている種が多く知られている。

        巣の外で餌を見つけると、その場で摂食して素嚢に納めて巣に持ち帰る場合もあるが、丸ごと、あるいは刻んで運ぶ行動がよく知られている。中には、砂粒に蜜をまぶして持ち帰るような、道具を使うアリもいる。その際、アリ達が列をなして行き来するのが見られるが、これは同じ家族の働き蟻によって通り道に残された足跡フェロモンをたどって行くことによるもの。古くはアリは道を覚えて歩くと考えられており、ファーブルの存命時にはこれが解明されていなかった。ちなみにアリ達がなんらかの原因で円を描くように列をなすと、足跡フェロモンをたどる習性があだとなり、延々と渦をまくように力尽きるまで回り続けることがある。[1]

        社会
        アリは卵 - 幼虫 - 蛹 - 成虫という完全変態を行う。卵から蛹までを保護しながら家族単位で生活することがよく知られている。蛹では繭を作る種類と作らない種類がある。いわゆる社会性昆虫の代表格であり、真社会性を持つが、実際にはかなりの多様性を含んでいる。

        成虫は性別や役割に応じて「女王アリ」「働きアリ」「兵隊アリ」「雄アリ」「処女女王アリ」と分化していることが一般的によく知られている。一般的には、雄アリと女王が交尾し、その後、女王が単独で営巣、産卵する。孵化した子が成長すると働きアリとなり、その後は女王が働きアリを産み続けることで、群れは大きくなる。女王が複数存在する例も少なくない。しかし中にはアミメアリのように「働きアリ」だけで卵を産んで増えるものや、クロオオアリのように大型の「働きアリ」は居ても「兵隊アリ」として区別できないものなど、様々な種類が存在する。アフリカ大陸のサブサハラに生息するマタベレアリでは、シロアリの巣を襲う兵隊アリのうち、負傷した仲間を救護する「衛生兵アリ」が確認されている（ドイツのビュルツブルグ大学などの研究）。また、ボルネオ島には、腹部を「自爆」させて毒液を外敵に浴びせて撃退する兵隊アリを擁する種がおり（オーストリアのウィーン工科大学などの研究）、群れとしての存続を優先する行動が見られる[2]。

      </Content>
    </Wrapper>
  );
}
